;; -*- no-byte-compile: t; -*-
;;; packages.el

;; testing
(package! coverlay)
;; (package! flycheck-jest)
(package! mocha)
(package! js-doc)
(package! orgit)
(package! all-the-icons-ivy)
;; (package! org-super-agenda)
(package! org-projectile)
(package! org-pomodoro)
(package! org-pdfview)
(package! org-brain)
;; (package! powerthesaurus :recipe (:fetcher github :repo "SavchenkoValeriy/emacs-powerthesaurus"))
(package! cheatsheet)
;; (package! ob-javascript)
(package! ob-javascript :recipe (:fetcher github :repo "zweifisch/ob-javascript" :files ("*")))
(package! ob-async :recipe (:fetcher github :repo "astahlman/ob-async" ))
(package! link-hint)
(package! plain-org-wiki :recipe (:fetcher github :repo "abo-abo/plain-org-wiki"))
